app/Http/Controllers/homepage/HomeController.php

SELECT `id`, `title`, `slug` FROM `category_articles` WHERE (`alanguage` = 'vi' and `ishome` = 1 and `publish` = 0) LIMIT 2
SELECT `id`, `title` FROM `category_slides` WHERE (`alanguage` = 'vi' and `keyword` = 'main-slide') LIMIT 1
SELECT `meta_title`, `meta_description`, `image`, `title`, `content_item` FROM `pages` WHERE (`alanguage` = 'vi' and `page` = 'index' and `publish` = 0) LIMIT 1
---
    public function index()
    {

        /*$slideHome = CategorySlide::select('title', 'id')->where(['alanguage' => config('app.locale'), 'keyword' => 'slide-home'])->with('slides')->first(); */

        $blogs = \App\Models\CategoryArticle::select('id', 'title', 'slug')->where(['alanguage' => config('app.locale'), 'ishome' => 1, 'publish' => 0])->limit(2)->get();

        $slideHome = \App\Models\CategorySlide::select('id', 'title')->where(['alanguage' => config('app.locale'), 'keyword' => 'main-slide'])->limit(1)->with('slides')->get();

        //dd($slideHome);


        /*
        $ishomeCategoryProduct = CategoryProduct::select('id', 'title', 'slug')
            ->where(['alanguage' => config('app.locale'), 'ishome' => 1, 'publish' => 0])
            ->orderBy('order', 'asc')
            ->orderBy('id', 'desc')
            ->limit(5)
            ->get();
        $ishomeProduct = Product::select('id', 'title', 'slug', 'description', 'price', 'price_sale', 'price_contact', 'image')
            ->where(['alanguage' => config('app.locale'), 'ishome' => 1, 'publish' => 0])
            ->orderBy('order', 'asc')
            ->orderBy('id', 'desc')
            ->limit(5)
            ->get();*/

        $fcSystem = $this->system->fcSystem();
        //page: HOME
        $page = Page::where(['alanguage' => config('app.locale'), 'page' => 'index', 'publish' => 0])
        ->select('pages.meta_title', 'pages.meta_description', 'pages.image', 'pages.title', 'pages.content_item')
        ->with('postmeta')
        ->first();