app/Http/Controllers/config/ConfigColumController.php

SELECT * FROM `config_colums` WHERE `trash` = 0 and `module` = 'pages' ORDER BY `module` ASC, `type` DESC
---
    public function index(Request $request)
    {
        $module = $this->module;
        $keyword = $request->keyword;
        $moduleGET = $request->module;
        $data = ConfigColum::where('trash', 0)->orderBy('module', 'asc')->orderBy('type', 'desc');
        if (!empty($keyword)) {
            $data =  $data->where('title', 'like', '%' . $keyword . '%');
        }
        if (!empty($moduleGET)) {
            $data =  $data->where('module', $moduleGET);
        }
        $data = $data->get();

SELECT * FROM `config_colums` WHERE `config_colums`.`id` = '16' LIMIT 1
---
    public function edit($id)
    {
        $detail  = ConfigColum::find($id);

INSERT INTO `config_colums` (`title`, `type`, `keyword`, `module`, `data`, `created_at`) VALUES ('Albums ảnh trang', 'json', 'albums', 'pages', '{\"title\":[\"H\\u00ecnh \\u1ea3nh\"],\"keyword\":[\"image\"],\"type\":[\"image\"]}', '2022-09-20 08:44:31')
---
    public function submit($request = [], $action = '', $id = 0)
    {
        if ($action == 'create') {
            $time = 'created_at';
        } else {
            $time = 'updated_at';
        }
        $_data = [
            'title' => $request['title'],
            'type' => $request['type'],
            'keyword' => $request['keyword'],
            'module' => $request['module'],
            'data' => json_encode($request['data']),
            $time => Carbon::now(),
        ];
        if ($action == 'create') {
            $id = ConfigColum::insertGetId($_data);

SELECT * FROM `config_colums` WHERE `config_colums`.`id` = '2' LIMIT 1
UPDATE `config_colums` SET `trash` = 1, `config_colums`.`updated_at` = '2022-09-24 14:03:54' WHERE `id` = 2
---
    public function deleteAll(Request $request)
    {
        $post = $request->param;

        if (isset($post['list']) && is_array($post['list']) && count($post['list'])) {
            foreach ($post['list'] as $id) {
                ConfigColum::find($id)->update(['trash' => 1]);