app/Components/backend_global_helper.php

SELECT `keyword`, `type`, `id` FROM `config_colums` WHERE (`trash` = 0 and `publish` = 0 and `module` = 'articles')
---
    function fieldsInsert($module = '', $id = 0, $request = '')
    {
        $field = \App\Models\ConfigColum::select('keyword', 'type', 'id')->where(['trash' => 0, 'publish' => 0, 'module' => $module])->get();

INSERT INTO `config_postmetas` (`module_id`, `module`, `config_colums_id`, `meta_key`, `meta_value`, `created_at`, `alanguage`) VALUES ('16', 'articles', 2, 'config_colums_json_albums', '{\"image\":[\"\\/upload\\/images\\/banner\\/banner-h5-1.jpg\"],\"title\":[\"Album \\u1ea3nh b\\u00e0i vi\\u1ebft 1\"],\"description\":[\"Album \\u1ea3nh b\\u00e0i vi\\u1ebft\"]}', '2022-09-20 08:54:49', 'vi')
---
                        $meta_value = $request[$meta_key];
                }
                if (!empty($meta_value) && $meta_value != 'null') {
                    DB::table('config_postmetas')->insert([
                        'module_id' => $id,
                        'module' => $module,
                        'config_colums_id' => $item->id,
                        'meta_key' => $meta_key,
                        'meta_value' => $meta_value,
                        'created_at' => Carbon::now(),
                        'alanguage' => config('app.locale'),
                    ]);