app/Components/Helper.php

    function catalogue_relation_ship($productid = 0, $catalogueid = 0, $tmp_catalogue = [], $module = '')
    {
        /*$_catalogue_relation_ship[] = array(
            'module' => $module,
            'moduleid' => $productid,
            'catalogueid' => $catalogueid,
            'created_at' => Carbon::now(),
        ); */
        $_catalogue_relation_ship = [];
        if (isset($tmp_catalogue)) {
            foreach ($tmp_catalogue as $v) {
                $_catalogue_relation_ship[] = array(
                    'module' => $module,
                    'moduleid' => $productid,
                    'catalogueid' => $v,
                    'created_at' => Carbon::now(),
                );
            }
        }
        DB::table('catalogues_relationships')->insert($_catalogue_relation_ship);
---
INSERT INTO `catalogues_relationships` (`catalogueid`, `created_at`, `module`, `moduleid`) VALUES (4, '2022-09-20 08:54:49', 'articles', '16'), (35, '2022-09-20 08:54:49', 'articles', '16')