app/Components/Html.php

    function getFunctions()
    {
        $data = [];
        $getFunctions = \App\Models\Permission::select('title')->where('publish', 0)->where('parent_id', 0)->get()->pluck('title');
---
SELECT `title` FROM `permissions` WHERE `publish` = 0 and `parent_id` = 0