app/Components/System.php

    function fcSystem()
    {
            $fcSystem = [];
            $system = \App\Models\General::select('keyword','content','content_en')->get();
---
SELECT `keyword`, `content`, `content_en` FROM `generals`