app/Http/Controllers/slide/backend/SlideController.php

    public function index()
    {
        $module = 'slide';
        $slideGroup = CategorySlide::latest()->where('alanguage', config('app.locale'))->paginate(20);
---
SELECT * FROM `category_slides` WHERE `alanguage` = 'vi' ORDER BY `created_at` DESC LIMIT 20 offset 0
SELECT count(*) as aggregate FROM `category_slides` WHERE `alanguage` = 'vi'