app/Http/Controllers/menu/backend/MenuController.php

SELECT * FROM `menus` ORDER BY `id` DESC
---
    public function index(Request $request)
    {
        $data =  Menu::orderBy('id', 'DESC')->get();

SELECT * FROM `menus` WHERE `menus`.`id` = '1' LIMIT 1
SELECT * FROM `menu_items` WHERE `alanguage` = 'vi' and `menu_id` = '1' and `parentid` = 0 ORDER BY `order` ASC, `id` DESC
---
    public function edit($id)
    {
        $module = $this->table;
        $detail  = Menu::find($id);
        if (!isset($detail)) {
            return redirect()->route('menus.index')->with('error', "Menu không tồn tại");
        }
        //lấy danh sách menu
        $menuitems = MenuItem::where('alanguage', config('app.locale'))->where('menu_id', $id)->where('parentid', 0)->orderBy('order', 'asc')->orderBy('id', 'desc')->get();

INSERT INTO `menu_items` (`title`, `slug`, `type`, `menu_id`, `alanguage`, `updated_at`, `created_at`) VALUES ('Bộ sưu tập', 'bo-suu-tap', 'category_products', '1', 'vi', '2022-09-24 10:41:05', '2022-09-24 10:41:05')
---
    public function addMenuItem(Request $request)
    {
        $data = $request->all();
        $menuid = $request->menuid;
        $module = $request->module;
        $ids = $request->ids;
        foreach ($ids as $id) {
            $detail = DB::table($module)->where('id', $id)->select('title', 'slug')->first();
            $data['title'] =  $detail->title;
            $data['slug'] =  $detail->slug;
            $data['type'] = $module;
            $data['menu_id'] = $menuid;
            $data['userid_created'] = Auth::user()->id;
            $data['alanguage'] = config('app.locale');
            MenuItem::create($data);

UPDATE `menu_items` SET `order` = 0, `parentid` = 0 WHERE `alanguage` = 'vi' and `id` = 57
UPDATE `menu_items` SET `parentid` = 60, `order` = 0 WHERE `id` = 61
---
    public function updateMenu(Request $request)
    {
        $content = $request->value;
        $array_menu = json_decode($request->value, true);
        foreach ($array_menu as $k => $v) {
            DB::table('menu_items')->where('alanguage', config('app.locale'))->where('id', $v['id'])->update(['order' => $k, 'parentid' => 0]);
            //cập nhập menu cha cấp 2
            if (!empty($v['children'])) {
                foreach ($v['children'] as $kc => $vc) {
                    DB::table('menu_items')->where('id', $vc['id'])->update(['parentid' => $v['id'], 'order' => $kc]);