app/Http/Controllers/comment/backend/CommentController.php

    public function index(Request $request)
    {
        $module = $this->table;
        $module_id = Comment::where('parentid', '=', 0)->groupBy('module_id')->select('module_id')->get();
---
SELECT `module_id` FROM `comments` WHERE `parentid` = 0 GROUP BY `module_id`

    public function edit($id)
    {
        $module = $this->table;
        $detail  = Comment::find($id);
        if (!isset($detail)) {
            return redirect()->route('comments.index')->with('error', "Bình luận không tồn tại");
        }
        $child = Comment::where('parentid', '=', $detail->id)->select('*', DB::raw('DATE(created_at) AS new_date'))->orderBy('id', 'desc')->paginate(env('APP_paginate'));
---
SELECT * FROM `comments` WHERE `comments`.`id` = '5' LIMIT 1
SELECT count(*) as aggregate FROM `comments` WHERE `parentid` = 5