app/Http/Controllers/page/backend/PageController.php

SELECT * FROM `pages` WHERE `alanguage` = 'vi' ORDER BY `id` DESC LIMIT 20 offset 0
SELECT count(*) as aggregate FROM `pages` WHERE `alanguage` = 'vi'
---
    public function index(Request $request)
    {
        $data =  Page::where('alanguage', config('app.locale'))->orderBy('id', 'DESC');
        $keyword = $request->keyword;
        if (!empty($keyword)) {
            $data =  $data->where('title', 'like', '%' . $keyword . '%');
        }
        $data =  $data->paginate(env('APP_paginate'));

SELECT * FROM `config_colums` WHERE (`trash` = 0 and `publish` = 0 and `module` = 'pages')
---
    public function create()
    {
        $module = $this->table;
        $field = \App\Models\ConfigColum::where(['trash' => 0, 'publish' => 0, 'module' => $module])->get();

SELECT * FROM `pages` WHERE `alanguage` = 'vi' and `pages`.`id` = '14' LIMIT 1
SELECT * FROM `config_colums` WHERE (`trash` = 0 and `publish` = 0 and `module` = 'pages')
---
    public function edit($id)
    {
        $module = $this->table;
        $detail  = Page::where('alanguage', config('app.locale'))->find($id);
        if (!isset($detail)) {
            return redirect()->route('pages.index')->with('error', "Trang không tồn tại");
        }
        $field = \App\Models\ConfigColum::where(['trash' => 0, 'publish' => 0, 'module' => $module])->get();

INSERT INTO `pages` (`title`, `page`, `slug`, `image`, `description`, `meta_title`, `meta_description`, `publish`, `userid_created`, `created_at`, `alanguage`) VALUES ('Liên hệ', 'contact', 'contact', , , , , '0', 1, '2022-09-20 09:07:28', 'vi')
SELECT * FROM `pages` WHERE `pages`.`id` = '14' LIMIT 1
UPDATE `pages` SET `pages`.`updated_at` = '2022-09-24 14:27:14' WHERE `id` = 14
DELETE FROM `config_postmetas` WHERE (`module_id` = '14' and `module` = 'pages')
---
    public function submitPage($request = [], $action = '', $id = 0, $image_url = '', $banner_url = '')
    {
        if ($action == 'create') {
            $time = 'created_at';
            $user = 'userid_created';
        } else {
            $time = 'updated_at';
            $user = 'userid_updated';
        }
        $_data = [
            'title' => $request['title'],
            'page' => $request['page'],
            'slug' => $request['page'],
            'image' => $image_url,
            'description' => $request['description'],
            //page: giới thiệu
            // 'content' => !empty($request['content']) ? $request['content'] : '',
            // 'content_item' => !empty($request['content_item']) ? json_encode($request['content_item']) : '',
            // 'video' => !empty($request['video']) ? $request['video'] : '',
            // 'banner' => !empty($banner_url) ? $banner_url : '',
            //end
            'meta_title' => $request['meta_title'],
            'meta_description' => $request['meta_description'],
            'publish' => $request['publish'],
            $user => Auth::user()->id,
            $time => Carbon::now(),
            'alanguage' => config('app.locale'),
        ];
        if ($action == 'create') {
            $id = Page::insertGetId($_data);
        } else {
            Page::find($id)->update($_data);
        }
        if ($action == 'update') {
            //xóa custom fields
            DB::table('config_postmetas')->where(['module_id' => $id, 'module' => $this->table])->delete();