app/Http/Controllers/contact/frontend/ContactController.php

    public function index()
    {
        //page: Contact

        $page = Page::where(['alanguage' => config('app.locale'), 'page' => 'contact'])->select('meta_title', 'meta_description', 'image', 'title')->first();
---
SELECT `meta_title`, `meta_description`, `image`, `title` FROM `pages` WHERE (`alanguage` = 'vi' and `page` = 'contact') LIMIT 1