app/Http/Controllers/dashboard/AjaxController.php

            DB::table('menu_items')->where('menu_id', $id)->delete();
        }
        //xóa router
        DB::table('router')->where('moduleid', $id)->where('module', $module)->delete();
---
DELETE FROM `router` WHERE `moduleid` = 141 and `module` = 'slides'