app/Http/Controllers/dashboard/DashboardController.php

SELECT * FROM `users` WHERE (`id` = 7) LIMIT 1
SELECT count(*) as aggregate FROM `products` WHERE (`alanguage` = 'vi')
SELECT count(*) as aggregate FROM `articles` WHERE (`alanguage` = 'vi')
SELECT count(*) as aggregate FROM `tours` WHERE (`alanguage` = 'vi')
SELECT count(*) as aggregate FROM `tour_books`
SELECT count(*) as aggregate FROM `contacts` WHERE (`type` = 'contact')
SELECT count(*) as aggregate FROM `orders`
---
    public function index()
    {
        //Cập nhập lại session login
        $user = \App\Models\User::where(["id" => Auth::user()->id])->first();
        $temp_permission = [];
        $roles = $user->roles;
        foreach ($roles as $k => $v) {
            $permissions = $v->permissions;
            foreach ($permissions as $v2) {
                if ($v2['parent_id'] == 22) {
                    $temp_permission[] = $v2['key_code'];
                }
            }
        }
        setcookie('authImagesManager', json_encode(array(
            'domain' => env('APP_URL_UPLOAD'),
            'email' => $user->email,
            'permission' => $temp_permission,
            'folder_upload' => ($user->id * 168) * 168 + 168,
        )), time() + (86400 * 30), '/');
        //end

        $module = 'dashboard';
        $totalProduct = Product::where(['alanguage' => config('app.locale')])->count();
        $totalArticle = Article::where(['alanguage' => config('app.locale')])->count();
        $totalTour = Tour::where(['alanguage' => config('app.locale')])->count();
        $totalTourBook = TourBook::count();
        $totalContact = Contact::where(['type' => 'contact'])->count();
        $totalOrder = Order::count();

SELECT Date(created_at) as date, COUNT(*) as "count" FROM `orders` WHERE `created_at` >= '2022-09-18 00:00:00' and `created_at` <= '2022-09-24 23:59:59' GROUP BY DATE_FORMAT(created_at, '%Y-%m-%d') ORDER BY `created_at` ASC
---
            $dayOfWeek[] = date('Y-m-d', strtotime("+$i day", strtotime($dateStart)));
        }
        if (!empty($dayOfWeek)) {
            $dayOfWeekQuery = Order::where('created_at', '>=', current($dayOfWeek) . " 00:00:00")->where('created_at', '<=', end($dayOfWeek) . " 23:59:59")
                ->groupBy(DB::raw("DATE_FORMAT(created_at, '%Y-%m-%d')"))
                ->orderBy('created_at', 'asc')
                ->get(array(
                    DB::raw('Date(created_at) as date'),
                    DB::raw('COUNT(*) as "count"')
                ));