app/Http/Controllers/dashboard/GeneralController.php

SELECT * FROM `generals` ORDER BY `created_at` DESC
---
    public function general()
    {
        $tab = config('system');
        $general = General::latest()->get();