app/Http/Controllers/article/backend/ArticleController.php

SELECT count(*) as aggregate FROM (SELECT `articles`.* FROM `articles` inner join `catalogues_relationships` on `articles`.`id` = `catalogues_relationships`.`moduleid` WHERE (`alanguage` = 'vi' and `type` = 0) and `catalogues_relationships`.`module` = 'articles' GROUP BY `catalogues_relationships`.`moduleid`) as `aggregate_table`
SELECT * FROM `articles` inner join `catalogues_relationships` on `articles`.`id` = `catalogues_relationships`.`moduleid` WHERE (`alanguage` = 'vi' and `type` = 0) and `catalogues_relationships`.`module` = 'articles' GROUP BY `catalogues_relationships`.`moduleid` ORDER BY `order` ASC, `id` DESC LIMIT 20 offset 0
SELECT `title`, `type` FROM `configis` WHERE (`module` = 'articles' and `active` = 1)
---
    public function index(Request $request)
    {
        $module = $this->table;
        $data =  Article::where(['alanguage' => config('app.locale'), 'type' => 0])->orderBy('order', 'ASC')->orderBy('id', 'DESC');
        $keyword = $request->keyword;
        $catalogueid = $request->catalogueid;
        $type = $request->type;
        if (!empty($keyword)) {
            $data =  $data->where($this->table . '.title', 'like', '%' . $keyword . '%');
        }
        if (!empty($type)) {
            $data =  $data->where($this->table . '.' . $type,  1);
        }
        $data = $data->join('catalogues_relationships', $this->table . '.id', '=', 'catalogues_relationships.moduleid')->where('catalogues_relationships.module', '=', $this->table);
        if (!empty($catalogueid)) {
            $data =  $data->where('catalogues_relationships.catalogueid', $catalogueid);
        }
        $data =  $data->groupBy('catalogues_relationships.moduleid');
        $data =  $data->paginate(env('APP_paginate'));
        if (is($type)) {
            $data->appends(['type' => $type]);
        }
        if (is($keyword)) {
            $data->appends(['keyword' => $keyword]);
        }
        if (is($catalogueid)) {
            $data->appends(['catalogueid' => $catalogueid]);
        }
        $htmlOption = $this->Nestedsetbie->dropdown();
        $configIs = \App\Models\Configis::select('title', 'type')->where(['module' => $this->table, 'active' => 1])->get();

SELECT `id`, `title` FROM `tags` WHERE `module` = 'articles' and `alanguage` = 'vi' ORDER BY `order` ASC, `id` DESC
SELECT * FROM `config_colums` WHERE (`trash` = 0 and `publish` = 0 and `module` = 'articles')
---
    public function create()
    {
        $dropdown = getFunctions();
        $module = $this->table;
        $htmlCatalogue = $this->Nestedsetbie->dropdown();
        //tags
        $getTags = [];
        if (old('tags')) {
            $getTags = old('tags');
        }
        // $tags = relationships('\App\Models\Tag', $getTags);
        //end tag
        $tags = Tag::select('id', 'title')->where('module', 'articles')->where('alanguage', config('app.locale'))->orderBy('order', 'asc')->orderBy('id', 'desc')->get();
        $field = \App\Models\ConfigColum::where(['trash' => 0, 'publish' => 0, 'module' => $module])->get();

SELECT * FROM `articles` WHERE `alanguage` = 'vi' and `articles`.`id` = '16' LIMIT 1
SELECT `id`, `title` FROM `tags` WHERE `module` = 'articles' and `alanguage` = 'vi' ORDER BY `order` ASC, `id` DESC
SELECT * FROM `config_colums` WHERE (`trash` = 0 and `publish` = 0 and `module` = 'articles')
---
    public function edit($id)
    {
        $dropdown = getFunctions();
        $module = $this->table;
        $detail  = Article::where('alanguage', config('app.locale'))->find($id);
        if (!isset($detail)) {
            return redirect()->route('articles.index')->with('error', "Bài viết không tồn tại");
        }
        $htmlCatalogue = $this->Nestedsetbie->dropdown();
        //tags
        $getTags = [];
        if (old('tags')) {
            $getTags = old('tags');
        } else {
            foreach ($detail->tags as $k => $v) {
                $getTags[] = $v['tagid'];
            }
        }
        $tags = Tag::select('id', 'title')->where('module', 'articles')->where('alanguage', config('app.locale'))->orderBy('order', 'asc')->orderBy('id', 'desc')->get();
        // $tags = relationships('\App\Models\Tag', $getTags);
        //end tag
        $getCatalogue = [];
        if (old('catalogue')) {
            $getCatalogue = old('catalogue');
        } else {
            $getCatalogue = json_decode($detail->catalogue);
        }
        $field = \App\Models\ConfigColum::where(['trash' => 0, 'publish' => 0, 'module' => $module])->get();

SELECT `id`, `title`, `slug`, `lft` FROM `category_articles` WHERE `id` = '4' LIMIT 1
SELECT `id`, `title` FROM `category_articles` WHERE `alanguage` = 'vi' and `lft` <= 2 and `rgt` >= 2 ORDER BY `lft` ASC, `order` ASC
---
    public function submit($request = [], $action = '', $id = 0, $image_url = '')
    {

        if ($action == 'create') {
            $time = 'created_at';
            $user = 'userid_created';
        } else {
            $time = 'updated_at';
            $user = 'userid_updated';
        }
        //danh mục phụ
        $catalogue = $request['catalogue'];
        $tmp_catalogue[] = (int)$request['catalogue_id'];
        if (isset($catalogue)) {
            foreach ($catalogue as $v) {
                if ($v != 0 && $v != $request['catalogue_id']) {
                    $tmp_catalogue[] = (int)$v;
                }
            }
        }
        //lấy danh mục cha (nếu có)
        $detail = CategoryArticle::select('id', 'title', 'slug', 'lft')->where('id', $request['catalogue_id'])->first();
        $breadcrumb = CategoryArticle::select('id', 'title')->where('alanguage', config('app.locale'))->where('lft', '<=', $detail->lft)->where('rgt', '>=', $detail->lft)->orderBy('lft', 'ASC')->orderBy('order', 'ASC')->get();

SELECT * FROM `articles` WHERE `articles`.`id` = '16' LIMIT 1
UPDATE `articles` SET `articles`.`updated_at` = '2022-09-20 08:54:49' WHERE `id` = 16
---
        if ($action == 'create') {
            $id = Article::insertGetId($_data);
        } else {
            Article::find($id)->update($_data);

DELETE FROM `catalogues_relationships` WHERE (`moduleid` = '16' and `module` = 'articles')
DELETE FROM `tags_relationships` WHERE (`moduleid` = '16' and `module` = 'articles')
DELETE FROM `router` WHERE (`moduleid` = '16' and `module` = 'articles')
DELETE FROM `config_postmetas` WHERE (`module_id` = '16' and `module` = 'articles')
---
            //xóa khi cập nhập
            if ($action == 'update') {
                //xóa catalogue_relationship
                DB::table('catalogues_relationships')->where(['moduleid' => $id, 'module' => $this->table])->delete();
                //xóa tags_relationship
                DB::table('tags_relationships')->where(['moduleid' => $id, 'module' => $this->table])->delete();
                //xóa bảng router
                DB::table('router')->where(['moduleid' => $id, 'module' => $this->table])->delete();
                //xóa custom fields
                DB::table('config_postmetas')->where(['module_id' => $id, 'module' => $this->table])->delete();

INSERT INTO `router` (`moduleid`, `module`, `slug`, `created_at`, `alanguage`) VALUES ('16', 'articles', 'cach-phoi-do-suit-cho-nam-dang-gay-van-day-dan', '2022-09-20 08:54:49', 'vi')
---
            //thêm tag
            $this->Helper->_table_relation_ship($id, $request['tags'], 'tags', 'tagid', $this->table);
            //thêm router
            DB::table('router')->insert([
                'moduleid' => $id,
                'module' => $this->table,
                'slug' => $request['slug'],
                'created_at' => Carbon::now(),
                'alanguage' => config('app.locale'),

            ]);