app/Http/Controllers/article/backend/CategoryController.php

    public function index(Request $request)
    {
        $module = $this->table;
        $data =  CategoryArticle::where('alanguage', config('app.locale'))->orderBy('lft', 'ASC');
        $keyword = $request->keyword;
        $type = $request->type;
        if (!empty($keyword)) {
            $data =  $data->where($this->table . '.title', 'like', '%' . $keyword . '%');
        }
        if (!empty($type)) {
            $data =  $data->where($this->table . '.' . $type,  1);
        }
        $data =  $data->paginate(env('APP_paginate'));
        if (is($keyword)) {
            $data->appends(['keyword' => $keyword]);
        }
        if (is($type)) {
            $data->appends(['type' => $type]);
        }
        $configIs = \App\Models\Configis::select('title', 'type')->where(['module' => $this->table, 'active' => 1])->get();
---
SELECT * FROM `category_articles` WHERE `alanguage` = 'vi' ORDER BY `lft` ASC LIMIT 20 offset 0
SELECT count(*) as aggregate FROM `category_articles` WHERE `alanguage` = 'vi'
SELECT `title`, `type` FROM `configis` WHERE (`module` = 'category_articles' and `active` = 1)