app/Providers/AppServiceProvider.php

SELECT `id` FROM `menus` WHERE `slug` = 'menu-header'
SELECT * FROM `menu_items` WHERE `menu_id` = 1 and `parentid` = 0 and `alanguage` = 'vi' ORDER BY `order` ASC
---
    public function boot()
    {
        Paginator::useBootstrap();
        Passport::routes();
        View::composer('homepage.*', function ($view) {
            $menu_id = \App\Models\Menu::where('slug', 'menu-header')->pluck('id');
            $menu_header =  \App\Models\MenuItem::where('menu_id', $menu_id)->where('parentid', 0)->orderBy('order')->where('alanguage', config('app.locale'))->with('children')->get();