app/Http/Controllers/user/backend/AuthController.php

SELECT * FROM `users` WHERE (`email` = 'admin@gmail.com') LIMIT 1
---
    public function store(Request  $request)
    {
        $request->validate([
            'email' => 'required|email',
            'password' => 'required',
        ], [
            'email.required' => 'Email là trường bắt buộc.',
            'email.email' => 'Email không đúng định dạng.',
            'password.required' => 'Mật khẩu là trường bắt buộc.',
        ]);
        // $remember = $request->has('remember_me') ? true : false;
        $remember = true;
        if (auth()->attempt([
            'email' => $request->email,
            'password' => $request->password,
        ], $remember)) {
            //lấy phân quyền upload image
            $user = User::where(["email" => $request->email])->first();