app/Http/Controllers/user/backend/PermissionController.php

SELECT * FROM `permissions` WHERE `parent_id` = 0 ORDER BY `created_at` DESC, `order` ASC
---
    public function index()
    {
        $data =  Permission::latest()->where('parent_id',0)->orderBy('order', 'asc')->get();