app/Http/Controllers/user/backend/UsersController.php

    public function index()
    {
        $module =  $this->module;
        $data = User::latest()->paginate(20);
---
SELECT * FROM `users` ORDER BY `created_at` DESC LIMIT 20 offset 0
SELECT count(*) as aggregate FROM `users`